# типы данных, функция input()

# in_1 = input('Введите число А: ')
# in_2 = input('Введите число Б: ')

# result = int(in_1) + int(in_2)

# print("Результат: ", result)

# целые числа
int_num = 777

# числа с плавающей точкой. числа пишутся через точку
float_num = 3.14 

# строка (строковой тип данных)
string = "кекв"

# булевые типы данных, boolean
boolean1 = True
boolean2 = False

# способ форматирования строк f-строка (f-string)
name = "Егор"
age = 27

s = f"Имя: {name}, Возраст: {age}"

# print(s)

# арифметические операции 
x = 5
y = 7

# сложение
res = x + y

# вычитание
res = x - y

# умножение
res = x * y

# обычное деление (результатом является число с плавающей точкой)
res = x / y

# целочисленное деление (результат целое число)
res = x // y

# деление по остатку (возвращает остаток деления)
res = x % y

# возведение в степень 
res = x ** y

# логические операции true false
x = 5
y = 3

# операцие "не равно"
result = x != y

# операцие "равно"
result = x == y




